7zip
acl
alsa-lib
alsa-topology-conf
alsa-ucm-conf
aom
archlinux-keyring
attr
audit
autoconf
automake
base
base-devel
bash
binutils
bison
boost-libs
brotli
bubblewrap
bzip2
c-ares
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cairo
chafa
clang
cmake
compiler-rt
coreutils
cppdap
cryptsetup
cuda
curl
dart-sass
dav1d
db5.3
dbus
dbus-broker
dbus-broker-units
dbus-units
dconf
ddcutil
debugedit
default-cursors
device-mapper
diffutils
directx-headers
e2fsprogs
expat
fakeroot
fastfetch
fd
fftw
file
filesystem
findutils
flac
flex
fontconfig
freetype2
fribidi
fzf
gawk
gc
gcc
gcc-libs
gdb
gdb-common
gdbm
gdk-pixbuf2
gettext
giflib
git
github-cli
glib2
glibc
glu
glycin
gmp
gnulib-l10n
gnupg
gnutls
go
gperftools
gpgme
gpgmepp
gradle
graphite
grep
groff
gtest
guile
gzip
harfbuzz
hicolor-icon-theme
highway
hugo
hwdata
i2c-tools
iana-etc
icu
imagemagick
iproute2
iptables
iputils
jansson
java-environment-common
java-runtime-common
jbigkit
jdk-openjdk
jq
json-c
jsoncpp
kbd
keyutils
kmod
krb5
lame
lcms2
leancrypto
libarchive
libassuan
libasyncns
libavif
libbpf
libcap
libcap-ng
libdatrie
libdeflate
libdrm
libedit
libelf
libevent
libffi
libgcrypt
libglvnd
libgpg-error
libidn2
libisl
libjpeg-turbo
libjxl
libksba
libldap
liblqr
libluv
libmakepkg-dropins
libmnl
libmpc
libnet
libnetfilter_conntrack
libnfnetlink
libnftnl
libnghttp2
libnghttp3
libngtcp2
libnl
libnsl
libogg
libp11-kit
libpcap
libpciaccess
libpng
libpsl
libpulse
libraqm
librsvg
libsasl
libseccomp
libsecret
libsndfile
libssh2
libsysprof-capture
libtasn1
libthai
libtiff
libtirpc
libtool
libunistring
libunwind
libusb
libutempter
libutf8proc
libuv
libverto
libvorbis
libvterm
libwebp
libx11
libxau
libxcb
libxcrypt
libxdmcp
libxext
libxfixes
libxft
libxi
libxkbcommon
libxkbcommon-x11
libxkbfile
libxml2
libxrandr
libxrender
libxshmfence
libxslt
libxxf86vm
libyaml
libyuv
licenses
linux-api-headers
llvm-libs
lm_sensors
lmdb
lsof
lua
lua51-lpeg
luajit
luarocks
lz4
lzo
m4
mailcap
make
maven
mesa
mpdecimal
mpfr
mpg123
msgpack-c
nano
ncurses
neovim
net-tools
nettle
ninja
node-gyp
nodejs
nodejs-nopt
npm
npth
nsight-compute
nsight-systems
nspr
nss
ocl-icd
ollama
ollama-cuda
oniguruma
opencl-nvidia
openjpeg2
openssl
opus
p11-kit
pacman
pacman-mirrorlist
pam
pambase
pango
paru
paru-debug
patch
pciutils
pcre2
perl
perl-error
perl-mailtools
perl-timedate
pinentry
pixman
pkgconf
poppler
popt
procps-ng
psmisc
python
rav1e
rdma-core
readline
resvg
rhash
ripgrep
ruby
rubygems
rustup
sed
semver
shadow
shared-mime-info
simdjson
source-highlight
spirv-tools
sqlite
sudo
svt-av1
systemd
systemd-libs
systemd-sysvcompat
tar
texinfo
tmux
tpm2-tss
tree
tree-sitter
tree-sitter-c
tree-sitter-cli
tree-sitter-lua
tree-sitter-markdown
tree-sitter-query
tree-sitter-vim
tree-sitter-vimdoc
ttf-nerd-fonts-symbols
ttf-nerd-fonts-symbols-common
tzdata
unibilium
unzip
util-linux
util-linux-libs
uv
vulkan-icd-loader
wayland
wget
which
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xkeyboard-config
xorgproto
xxhash
xz
yazi
yyjson
zip
zlib
zlib-ng
zstd
