7zip
base
base-devel
chafa
clang
cmake
dart-sass
dconf
ddcutil
directx-headers
docker
fastfetch
fd
ffmpeg
fzf
gdb
git
github-cli
go
gradle
hugo
imagemagick
jdk-openjdk
jq
libdrm
libpulse
libxrandr
lldb
lua
luarocks
maven
neovim
ninja
nodejs
npm
ocl-icd
poppler
python-docutils
resvg
ripgrep
ruby
rustup
sudo
tmux
tree
tree-sitter-cli
uv
vulkan-icd-loader
wget
yay-debug
yazi
